#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//for循环 -- 最常用的循环


//for循环的结构

//for（表达式1；表达式2；表达式3）
//循环语句；

//表达式1为初始化部分，用于表达初始化部分。
//表达式2为条件判断部分，用于判断循环什么时候终止
//表达式3为调整部分，用于循环条件的调整

//for循环的意义
//int main()
//{
//	int i = 0;//初始化
//	while (i < 10)//判断
//	{
//		i++;//调整
//	}
//	return 0;
//}//当代码复杂后循环的三个部分将会离得很远，不好调整，for循环可以解决这一点

//int main()
//{
//	int i = 0;
//	for (i = 1; i <= 10; i++)
//	{
//		if (i == 5)
//			continue;
//		printf("%d\n", i);
//	}
//	return 0;
//}

//for语句执行逻辑顺序见资源文件

//建议：1、不可在for循环体内改变循环体变量
//2、建议for语句的循环控制变量的取值采用“前闭后开”的写法。比如尽量写成i<10,而不写i<=9

//for循环的初始、调整、判断都可以省略。当省略判断部分，则判断条件恒为真

//int main()
//{
//	int i = 0;
//	int j = 0;
//	for (i=0; i < 10; i++)
//		for (j=0; j < 10; j++)//思考如果省略此处j=0会发生什么
//		{
//			printf("%d,%d haha\n", i,j);
//		}
//	return 0;
//}

//int main()
//{
//	int x, y;
//	for (x = 0, y = 0; x < 2 || y < 5; x++, y++)
//	{
//		printf("hehe\n");
//	}
//	return 0;
//}

//以下代码循环几次？
//int main()
//{
//	int a, b;
//	for (a = 0,b=0; b=0 ; a++,b++)
//	{
//		b++;
//	}
//	return 0;
//}//答案：0次 判断部分是赋值语句，且为0，0为假所以不循环